**<font size="6" color="red">ch10_DB연동</font>**
# 1절. SQLite 데이터 베이스 연결

## SQLite와 파이썬
- SQLite 데이터베이스는 별도의 서버프로세스 없이 SQL을 사용하여 DB액세스 할 수 있도록 만든 간단한 디스크 기반 데이터베이스를 제공하는 C언어로 개발된 라이브러리

- SQLite는 프로토 타입(시제품 나오기 전까지 제품)을 만들 때까지 사용. 정식 제품은 오라클이나 다른 DBMS를 이식

In [56]:
import sqlite3
sqlite3.sqlite_version

'3.33.0'

In [57]:
# DB 연결 객체 생성시, 파일이 없으면 파일 생성. 파일이 없으면 그 파일 연결
conn = sqlite3.connect('data/ch10_example.db')

In [58]:
conn.close()

In [73]:
cursor = conn.cursor()

In [60]:
cursor.execute('''
CREATE TABLE MEMBER(
NAME TEXT,
AGE INT,
EMAIL TEXT
)
''')

0

In [9]:
cursor.execute('''DROP TABLE MEMBER''')

In [61]:
cursor.execute("INSERT INTO MEMBER VALUES ('홍길동',20,'h@hong.com')")
cursor.execute("INSERT INTO MEMBER VALUES ('유길동',23,'y@hong.com')")
cursor.execute("INSERT INTO MEMBER VALUES ('마길동',30,'m@hong.com')")

1

In [12]:
conn.commit()

In [19]:
import sqlite3 as lite

database_filename = 'data/ch10_example.db'
conn = lite.connect(database_filename)
conn.row_factory = lite.Row

cs = conn.cursor()
cs.execute('SELECT * FROM MEMBER')
r = cs.fetchone()
print(r)
print(r['name'])
print(type(r))
print(r.keys())

<sqlite3.Row object at 0x00000210E9D70EB0>
홍길동
<class 'sqlite3.Row'>
['NAME', 'AGE', 'EMAIL']

AttributeError: 'sqlite3.Row' object has no attribute 'values'

In [63]:
#SELECT 문의 결과를 받는 함수 : 
#fetchall(), - 결과를 모두 
#fetchone()  - 결과를 한행
#fetchmany(n) - 결과를 n행
print(cursor.fetchall())

(('홍길동', 20, 'h@hong.com'), ('유길동', 23, 'y@hong.com'), ('마길동', 30, 'm@hong.com'))

In [66]:
data = cursor.fetchall()

In [67]:
data

(('홍길동', 20, 'h@hong.com'),
 ('유길동', 23, 'y@hong.com'),
 ('마길동', 30, 'm@hong.com'))

In [69]:

for d in data:
    print(d[0])

홍길동
유길동
마길동

In [48]:
cursor.execute('SELECT * FROM MEMBER')


member = cursor.fetchmany(1)
print(member)
type(member)

[('홍길동', 20, 'h@hong.com')]

list

In [55]:
member = cursor.fetchmany(1)
print(member)
type(member)

[]

list

In [56]:
cursor.close()
conn.close()

## SQL 구문에 파라미터 사용하기

- qmark, named(추천)방법

In [61]:
conn = sqlite3.connect('data/ch10_example.db')
cursor = conn.cursor()
cursor.execute("SELECT * FROM MEMBER WHERE NAME LIKE ('%길동')")
print(cursor.fetchall())

[('홍길동', 20, 'h@hong.com'), ('유길동', 23, 'y@hong.com'), ('마길동', 30, 'm@hong.com'), ('안길동', 40, 'a@hong.com')]

In [62]:
name1 = input('검색할 이름1 :')
name2 = input('검색할 이름2 :')
names = (name1, name2)

cursor.execute("SELECT * FROM MEMBER WHERE NAME IN (?,?)",names)
print(cursor.fetchall())

검색할 이름1 :홍길동
검색할 이름2 :마길동
[('홍길동', 20, 'h@hong.com'), ('마길동', 30, 'm@hong.com')]

In [64]:
# 파라메터 사용하기 : named 방법
name = input('검색하고자 하는 이름 :')
cursor.execute('SELECT * FROM MEMBER WHERE NAME=:name',{'name':name})
print(cursor.fetchall())

검색하고자 하는 이름 :홍길동
[('홍길동', 20, 'h@hong.com')]

In [65]:
name = input('입력할 이름?')

try:
    age = input('입력할 나이?')    
except:
    print('나이를 잘못 입력하셨어요. 초기값으로 20살')
    age = 20
    
email = input('입력할 메일?')

cursor.execute('INSERT INTO MEMBER VALUES (:name, :age, :email)',{'name':name, 'age':age, 'email':email})

입력할 이름?서길동
입력할 나이?33
입력할 메일?seo@seo.com

In [74]:
cursor.execute('SELECT * FROM MEMBER')

while (True):
    member = cursor.fetchone()
    if(member is None):
        break
    print(member)

('홍길동', 20, 'h@hong.com')
('유길동', 23, 'y@hong.com')
('마길동', 30, 'm@hong.com')
('안길동', 40, 'a@hong.com')

In [69]:
cursor.close()
conn.close()

# Oracle 데이터 베이스 연결

In [1]:
import cx_Oracle

oracle_dsn = cx_Oracle.makedsn(host='localhost',port=1521, sid='xe')

In [7]:
print(oracle_dsn)
conn = cx_Oracle.connect('scott','tiger',dsn=oracle_dsn)

(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=localhost)(PORT=1521))(CONNECT_DATA=(SID=xe)))

In [2]:
#conn 얻어오는 방법(1)
oracle_dsn = cx_Oracle.makedsn(host='localhost',port=1521, sid='xe')
conn = cx_Oracle.connect('scott','tiger',dsn=oracle_dsn)

In [8]:
conn.close()

In [44]:
conn = cx_Oracle.connect('scott','tiger','localhost:1521/xe')

In [10]:
conn

In [4]:
cursor = conn.cursor()

In [5]:
sql = '''
SELECT *  FROM EMP
'''

cursor.execute(sql)

for e in cursor:
    print(e)

(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20)
(7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30)
(7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30)
(7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20)
(7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30)
(7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30)
(7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10)
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000.0, None, 20)
(7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10)
(7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30)
(7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100.0, None, 20)
(7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30)
(7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20)
(7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)

In [47]:
sql = 'SELECT * FROM EMP WHERE DEPTNO=:deptno'
deptno = input('검색하고자 하는 부서 번호는?')
cursor.execute(sql, {'deptno':deptno})


for emp in cursor:
    print(emp)

검색하고자 하는 부서 번호는?r

DatabaseError: ORA-01722: invalid number

In [6]:
import pandas as pd
cursor.execute('SELECT * FROM EMP')
data = cursor.fetchall()

In [7]:
data_df = pd.DataFrame(data)

In [8]:
data_df

       0       1          2       3          4       5       6   7
0   7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN  20
1   7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0  30
2   7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0  30
3   7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN  20
4   7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0  30
5   7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN  30
6   7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN  10
7   7788   SCOTT    ANALYST  7566.0 1982-12-09  3000.0     NaN  20
8   7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN  10
9   7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0  30
10  7876   ADAMS      CLERK  7788.0 1983-01-12  1100.0     NaN  20
11  7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN  30
12  7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN  20
13  7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN  10

In [22]:
# 각 필드 특징 정보(필드명, type, display_type, 내부크기, 정확도, scale, nullable)
cursor.description

[('EMPNO', <cx_Oracle.DbType DB_TYPE_NUMBER>, 5, None, 4, 0, 0),
 ('ENAME', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 10, 10, None, None, 1),
 ('JOB', <cx_Oracle.DbType DB_TYPE_VARCHAR>, 9, 9, None, None, 1),
 ('MGR', <cx_Oracle.DbType DB_TYPE_NUMBER>, 5, None, 4, 0, 1),
 ('HIREDATE', <cx_Oracle.DbType DB_TYPE_DATE>, 23, None, None, None, 1),
 ('SAL', <cx_Oracle.DbType DB_TYPE_NUMBER>, 11, None, 7, 2, 1),
 ('COMM', <cx_Oracle.DbType DB_TYPE_NUMBER>, 11, None, 7, 2, 1),
 ('DEPTNO', <cx_Oracle.DbType DB_TYPE_NUMBER>, 3, None, 2, 0, 1)]

In [30]:
cols = [col[0] for col in cursor.description]

In [9]:
data_df.columns = [col[0] for col in cursor.description]

In [10]:
data_df

    EMPNO   ENAME        JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0    7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN      20
1    7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2    7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3    7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4    7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30
5    7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN      30
6    7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN      10
7    7788   SCOTT    ANALYST  7566.0 1982-12-09  3000.0     NaN      20
8    7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN      10
9    7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0      30
10   7876   ADAMS      CLERK  7788.0 1983-01-12  1100.0     NaN      20
11   7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN      30
12   7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN      20
13   7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN      10

# MariaDB 데이터 베이스 연결

In [33]:
import pymysql

In [53]:
conn = pymysql.connect(host='localhost',
                      port=3306,
                      db='kimdb',
                      user='root',
                      passwd='mysql',
                      charset='utf8',
                      autocommit=True)

In [37]:
conn

In [54]:
cursor= conn.cursor()
sql = 'select * from personal'
cursor.execute(sql)
result = cursor.fetchall()

In [39]:
result

((1001, 'bill', 'president', None, datetime.date(1989, 1, 10), 7000, None, 10),
 (1111, 'smith', 'manager', 1001, datetime.date(1990, 12, 17), 1000, None, 10),
 (1112, 'ally', 'salesman', 1116, datetime.date(1991, 2, 20), 1600, 500, 30),
 (1113, 'word', 'salesman', 1116, datetime.date(1992, 2, 24), 1450, 300, 30),
 (1114, 'james', 'manager', 1001, datetime.date(1990, 4, 12), 3975, None, 20),
 (1116, 'johnson', 'manager', 1001, datetime.date(1991, 5, 1), 3550, None, 30),
 (1118, 'martin', 'analyst', 1111, datetime.date(1991, 9, 9), 3450, None, 10),
 (1121, 'kim', 'clerk', 1114, datetime.date(1990, 12, 8), 4000, None, 20),
 (1123, 'lee', 'salesman', 1116, datetime.date(1991, 9, 23), 1200, 0, 30),
 (1226, 'park', 'analyst', 1111, datetime.date(1990, 1, 3), 2500, None, 10))

In [55]:
personal = pd.DataFrame(result)
personal.columns =  [col[0] for col in cursor.description]
personal

    pno    pname        job  manager   startdate   pay  bonus  dno
0  1001     bill  president      NaN  1989-01-10  7000    NaN   10
1  1111    smith    manager   1001.0  1990-12-17  1000    NaN   10
2  1112     ally   salesman   1116.0  1991-02-20  1600  500.0   30
3  1113     word   salesman   1116.0  1992-02-24  1450  300.0   30
4  1114    james    manager   1001.0  1990-04-12  3975    NaN   20
5  1116  johnson    manager   1001.0  1991-05-01  3550    NaN   30
6  1118   martin    analyst   1111.0  1991-09-09  3450    NaN   10
7  1121      kim      clerk   1114.0  1990-12-08  4000    NaN   20
8  1123      lee   salesman   1116.0  1991-09-23  1200    0.0   30
9  1226     park    analyst   1111.0  1990-01-03  2500    NaN   10

# 회원관리

In [11]:
?cursor.execute